protogia/avr-descriptionfiles-4-nim/svd/ATmega8HVA.atdf.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FET</name>
      <description>FET Control</description>
      <baseAddress>0x000000F0</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>FCSR</name>
          <description>FET Control and Status Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CFE</name>
              <description>Charge FET Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DFE</name>
              <description>Discharge FET Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CPS</name>
              <description>Current Protection Status</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DUVRD</name>
              <description>Deep Under-Voltage Recovery Disable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>FUSE</name>
      <description>Fuses</description>
      <baseAddress>0x00000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>LOW</name>
          <description>No Description.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SUT</name>
              <description>Select start-up time</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>6CK_14CK_4MS</name>
                  <description>Start-up time 6 CK/14 CK + 4 ms</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6CK_14CK_8MS</name>
                  <description>Start-up time 6 CK/14 CK + 8 ms</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6CK_14CK_16MS</name>
                  <description>Start-up time 6 CK/14 CK + 16 ms</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6CK_14CK_32MS</name>
                  <description>Start-up time 6 CK/14 CK + 32 ms</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6CK_14CK_64MS</name>
                  <description>Start-up time 6 CK/14 CK + 64 ms</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6CK_14CK_128MS</name>
                  <description>Start-up time 6 CK/14 CK + 128 ms</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6CK_14CK_256MS</name>
                  <description>Start-up time 6 CK/14 CK + 256 ms</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6CK_14CK_512MS</name>
                  <description>Start-up time 6 CK/14 CK + 512 ms</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SELFPRGEN</name>
              <description>Self Programming enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DWEN</name>
              <description>Debug Wire enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPIEN</name>
              <description>Serial program downloading (SPI) enabled</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EESAVE</name>
              <description>Preserve EEPROM through the Chip Erase cycle</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTON</name>
              <description>Watch-dog Timer always on</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>LOCKBIT</name>
      <description>Lockbits</description>
      <baseAddress>0x00000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>LOCKBIT</name>
          <description>No Description.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LB</name>
              <description>Memory Lock</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PROG_VER_DISABLED</name>
                  <description>Further programming and verification disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_DISABLED</name>
                  <description>Further programming disabled</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_LOCK</name>
                  <description>No memory lock features enabled</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
